app/controllers/home_controller.rb

  def save_data
    #render :text=>"" and return
    if params[:Add]=='Save'
      @data_entry=DataEntry.new(params[:data_entry])
      @data_entry_image=DataEntryImage.new(params[:data_entry_image])
      if @data_entry.save
        if @data_entry_image.save
          @data_entry_image.update_attributes(:data_entry_id=> @data_entry.id)
        else
          DataEntry.delete(@data_entry.id)
---
INSERT INTO `data_entries` (`location`, `created_at`, `updated_at`, `data_entry_category_id`, `property_name`) VALUES('', '2011-04-18 05:25:58', '2011-04-18 05:25:58', NULL, '')
INSERT INTO `data_entry_images` (`photo_file_size`, `created_at`, `photo_file_name`, `thumbnail`, `updated_at`, `photo_content_type`, `parent_id`, `height`, `data_entry_id`, `status`, `width`) VALUES(499922, '2011-04-19 12:12:23', '5102421431_17b180ae93_b.jpg', NULL, '2011-04-19 12:12:23', 'image/jpeg', NULL, NULL, NULL, NULL, NULL)
DELETE FROM `data_entries` WHERE (`id` IN (29))
DELETE FROM `data_entry_images` WHERE (`id` IN (16))

  def update
        if params[:Add]=='Save'
      @data_entry=DataEntry.new(params[:data_entry])
      @data_entry_image=DataEntryImage.new(params[:data_entry_image])
      if @data_entry.save
        if @data_entry_image.save
          @data_entry_image.update_attributes(:data_entry_id=> @data_entry.id)
        else
          DataEntry.delete(@data_entry.id)
---
INSERT INTO `data_entries` (`location`, `created_at`, `updated_at`, `data_entry_category_id`, `property_name`) VALUES('aa,aa', '2011-04-19 11:40:07', '2011-04-19 11:40:07', 3, 'xxxxaa')
INSERT INTO `data_entry_images` (`photo_file_size`, `created_at`, `photo_file_name`, `thumbnail`, `updated_at`, `photo_content_type`, `parent_id`, `height`, `data_entry_id`, `status`, `width`) VALUES(499922, '2011-04-19 13:03:01', '5102421431_17b180ae93_b.jpg', NULL, '2011-04-19 13:03:01', 'image/jpeg', NULL, NULL, NULL, NULL, NULL)
DELETE FROM `data_entries` WHERE (`id` IN (79))